package com.melisa.rincemathew.malayalamgkquiz;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by RinceMathew on 24-02-2018.
 */
public class QstnArray {

    private int questionNumber;
    private List<String> questionList=new ArrayList<>();

    public QstnArray()
    {

        questionList.add("ആദ്യത്തെ ഇന്ത്യൻ പ്രസിഡന്റ് തിരഞ്ഞെടുപ്പ് നടന്ന വർഷം?");//0
        questionList.add("കേരളത്തിലെ ആദ്യത്തെ തുറന്ന ജയില്\u200D ഏത് ജില്ലയില്\u200D ആണ് ?");//1
        questionList.add("സമുദ്രതീരം ഇല്ലാത്തതും കേരളത്തിലെ ജില്ലകളുമായി മാത്രം അതിര്ത്തി പങ്കിടുന്നതുമായ ഏക ജില്ല ഏത്?");//2
        questionList.add("വിസ്ത്യതിയില് രണ്ടാം സ്ഥാനത്ത് നില്ക്കുന്ന ജില്ല ഏത്?");//3
        questionList.add("കേരളത്തിലെ ഏറ്റവും വലിയ കോര്പ്പറേഷന് ഏത് ?:");//4
        questionList.add("കേരളത്തിലെ ആദ്യ മുന്സിപാലിറ്റി: ");//5
        questionList.add("കേരളത്തിലെ ഏറ്റവും വലിയ ജില്ല ഏത്?");//6
        questionList.add("കേരളത്തില് ഏറ്റവും കൂടുതല് ജനസംഖ്യയുള്ള ജില്ല ഏത്?");//7
        questionList.add("കോഴിക്കോട് വിമാനത്താവളം സ്ഥിതിചെയ്യുന്ന ജില്ല");//8
        questionList.add("കോഴിക്കോടിന്റെ വടക്കുഭാഗത്തുള്ള ഫ്രഞ്ചധീന പ്രദേശം");//9
        questionList.add("മലബാര് സ്പെഷ്യല് പോലീസിന്റെ ആസ്ഥാനം എവിടെ?");//10
        questionList.add("ഷോർട്ട് ഹാൻഡിന്റെ ഉപജ്ഞാതാവ്");//11
        questionList.add("റേഡിയോ കണ്ടുപിടിച്ചത് ആര്");//12
        questionList.add("നെലിന്റെ ദാനം എന്നറിയപ്പെടുന്നത്");//13
        questionList.add("ഇന്ത്യയിലെ വെനീസ്");//14
        questionList.add("മാഗ്ന കാർട്ട ഒപ്പുവെച്ചത് എന്ന്");//15
        questionList.add("രണ്ടാം ലോകമഹായുദ്ധം ആരംഭിച്ചത്‌ എന്ന്");//16
        questionList.add("അമേരിക്കയ്ക്ക് സ്വാതന്ത്യം ലഭിച്ചത് എന്ന്");//17
        questionList.add("ഫിലോളജി എന്തുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു");//18
        questionList.add("ഇന്ത്യയെന്ന പേരിന് നിദാനമായ നദി");//19
        questionList.add("ഡീസൽ എഞ്ചിൻ കണ്ടുപിടിച്ചത്");//20
        questionList.add("ഇന്ത്യൻ നാഷണൽ കോൺഗ്രസ് സ്ഥാപിച്ചത്");//21
        questionList.add("സി.ബി.ഐ.യുടെ പൂർണരൂപം");//22
        questionList.add("കുടൽ കമ്മീഷൻ എന്തിനെക്കുറിച്ചാണ് അന്വേഷിച്ചത്");//23
        questionList.add("വിമോചന സമരകാലത്ത് ജീവശിഖാജാഥ നയിച്ചത്");//24
        questionList.add("ശാസ്താംകോട്ട തടാകം ഏതു ജില്ലയിൽ");//25
        questionList.add("രാമാനുജം ഏത് വിഷയത്തിൽ പ്രസിദ്ധൻ");//26
        questionList.add("ഏഴു കുന്നുകളുടെ നഗരം");//27
        questionList.add("കുഷ്ഠരോഗമുണ്ടാക്കുന്ന അണു");//28
        questionList.add("കണ്ണിന്റെ ശരിയായ പ്രവർത്തനത്തിന് ആവശ്യമായ വിറ്റാമിൻ");//29
        questionList.add(" നാരങ്ങയിലും ഓറഞ്ചിലും അടങ്ങിയിരിക്കുന്ന അമ്ളം");//30
        questionList.add("ശ്രീനാരായണഗുരുവിനെ രണ്ടാം ബുദ്ധൻ എന്നു വിശേഷിപ്പിച്ചത്");//31
        questionList.add("ഐസ് പ്ലാന്റുകളിൽ ഉപയോഗിക്കുന്ന വാതകം");//32
        questionList.add("ആദ്യത്തെ വേദം");//33
        questionList.add("ഫാക്ടംഫോസിന്റെ രാസനാമം");//34
        questionList.add("കായിക പരിശീലകർക്കുള്ള ദേശീയ അവാർഡ്");//35
        questionList.add("ജൈനമത സ്ഥാപകൻ");//36
        questionList.add("രക്തസമ്മർദം അളക്കുന്ന ഉപകരണം");//37
        questionList.add("വൈദ്യുതിയുടെ വാണിജ്യ ഏകകം");//38
        questionList.add("അശോക ചക്രവർത്തിയുടെ തലസ്ഥാനം");//39
        questionList.add("മുഗൾ ഭരണത്തിന് അടിത്തറയിട്ട യുദ്ധം");//40
        questionList.add("നുമിസ്മാറ്റിക്സ് എന്തിനെക്കുറിച്ചുള്ള പഠനമാണ്");//41
        questionList.add("ആദ്യത്തെ കേന്ദ്ര വനിതാ ക്യാബിനറ്റ് മന്ത്രി");//42
        questionList.add("ഇന്ത്യൻ യൂണിയന്റെ ഏറ്റവും തെക്കേയറ്റം");//43
        questionList.add("ലോകത്തിലെ ഏറ്റവും വലിയ ക്ഷേത്ര സമുച്ചയം");//44
        questionList.add("സ്വാമി വിവേകാനന്ദന്റെ ഗുരു");//45
        questionList.add("കുവൈറ്റിലെ നാണയം");//46
        questionList.add("നൊബേൽ സമ്മാനം നേടിയ ആദ്യത്തെ ഭാരതീയൻ");//47
        questionList.add("ആപേക്ഷികതാ സിദ്ധാന്തത്തിന്റെ ഉപജ്ഞാതാവ്");//48
        questionList.add("ആദ്യത്തെ ലോകകപ്പ് ക്രിക്കറ്റിനു വേദിയായത്");//49
        questionList.add("ഹെപ്പറ്റൈറ്റിസ് ബാധിക്കുന്ന ശരീരഭാഗം");//50
        questionList.add("ഗളിവറുടെ സഞ്ചാരകഥകൾ രചിച്ചത്");//51
        questionList.add("സുവർണ പഗോഡകളുടെ നാട് എന്നറിയപ്പെടുന്ന രാജ്യം");//52
        questionList.add("വിളക്കേന്തിയ വനിത എന്നറിയപ്പെട്ടത്");//53
        questionList.add("സന്തോഷ് ട്രോഫി ഏതുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു");//54
        questionList.add("ലോകത്തിന്റെ മേൽക്കൂര എന്നറിയപ്പെടുന്നത്");//55
        questionList.add("ഇന്ത്യയിൽ ധീരതയ്ക്കുള്ള പരമോന്നത സൈനിക ബഹുമതി");//56
        questionList.add("പ്രഭാതനക്ഷത്രം എന്നറിയപ്പെടുന്നത്");//57
        questionList.add("ഇന്ത്യാ ഗേറ്റ് എവിടെയാണ്");//58
        questionList.add("നാഷണൽ ഇൻസ്റ്റിറ്റ്യൂട്ട് ഓഫ് ഓഷ്യാനോഗ്രഫി എവിടെയാണ്?");//59
        questionList.add("ഏഷ്യൻ ഡെവലപ്മെന്റ് ബാങ്കിന്റെ ആസ്ഥാനം");//60
        questionList.add("മതമില്ലാത്ത ശാസ്ത്രം മുടന്തനാണ്, ശാസ്ത്രമില്ലാത്ത മതം കുരുടനും ആരുടേതാണ് ഈ വാക്കുകൾ");//61
        questionList.add("ഈർപ്പം അളക്കുന്നതിനുള്ള ഉപകരണം");//62
        questionList.add("കുളു താഴ്വര ഏത് സംസ്ഥാനത്താണ്");//63
        questionList.add("ചിപ്കോ പ്രസ്ഥാനം എന്തിനുവേണ്ടി നിലകൊള്ളുന്നു");//64
        questionList.add("കോർബറ്റ് നാഷണൽ പാർക്ക് ഏതു സംസ്ഥാനത്ത്");//65
        questionList.add("ഇന്ത്യൻ യൂണിയന്റെ ബഡ്ജറ്റിന്റെ പിതാവ് എന്നറിയപ്പെടുന്നത്");//66
        questionList.add("സർഗാസോ കടൽ ഏതു സമുദ്രത്തിന്റെ ഭാഗമാണ്");//67
        questionList.add("ജാലിയൻവാലാബാഗ് ഏതു സംസ്ഥാനത്താണ്");//68
        questionList.add("കവിയുടെ കാൽപാടുകൾ ആരുടെ ആത്മകഥയാണ്");//69
        questionList.add("കേരളത്തിന്റെ വിസ്തീർണം");//70
        questionList.add("വേളാങ്കണ്ണി ഏത് സംസ്ഥാനത്താണ്");//71
        questionList.add("കേരളത്തിലെ ആദ്യ മുഖ്യമന്തി");//72
        questionList.add("മൂകാംബിക ക്ഷേത്രം ഏത് സംസ്ഥാനത്ത്");//73
        questionList.add("ഏതെല്ലാം ഭാഷകൾ ചേർന്നതാണ് മണിപ്രവാളം");//74
        questionList.add("ഇന്ത്യയിലെ ആദ്യത്തെ, തദ്ദേശീയമായ നിശ്ശബ്ദ സിനിമ");//75
        questionList.add("ഇന്ത്യൻ ഇൻസ്റ്റിറ്റ്യൂട്ട് ഓഫ് ആസ്ട്രോഫിസിക്സ് എവിടെയാണ്");//76
        questionList.add("ബൊട്ടാണിക്കൽ സർവേ ഓഫ് ഇന്ത്യയുടെ ആസ്ഥാനം");//77
        questionList.add("ആൾ ഇന്ത്യ ഇൻസ്റ്റിറ്റ്യൂട്ട് ഓഫ് സ്പീച്ച് ആന്റ് ഹിയറിംഗ് എവിടെയാണ്");//78
        questionList.add("എവിടെയാണ് ശങ്കരദേവൻ ഭക്തിപ്രസ്ഥാനം പ്രചരിപ്പിച്ചത്");//79
        questionList.add("ഇന്ത്യയിൽ സായുധ സേനകളുടെ സുപ്രീം കമാൻഡർ");//80
        questionList.add("അടുക്കളയിൽനിന്ന് അരങ്ങത്തേക്ക് രചിച്ചതാര്");//81
        questionList.add("ഇന്ത്യയിൽ ആദ്യമായി ഓസ്കർ അവാർഡ് നേടിയത്");//82
        questionList.add("സിന്ധുനദീതട സംസ്ക്കാരത്തിന്റെ അവശിഷ്ടങ്ങൾ കണ്ടത്തി സ്ഥലം");//83
        questionList.add("പുരാണപ്രകാരം, കേരളത്തെ കടൽമാറ്റി സൃഷ്ടിച്ചത്");//84
        questionList.add("മാജാറുകൾ എവിടുത്തെ ജനതയാണ്");//85
        questionList.add("ആൽഗകൾ എവിടെ കാണപ്പെടുന്നു");//86
        questionList.add("മാടമ്പ് കുഞ്ഞുക്കുട്ടന്റെ യഥാർഥ പേര്");//87
        questionList.add("മന്നത്ത് പദ്മനാഭന്റെ ആത്മകഥ");//88
        questionList.add("പല്ലില്ലാത്ത തിമിംഗിലം");//89
        questionList.add("ആരുടെ അന്ത്യവിശ്രമ സ്ഥലമാണ് കുമാരകോടി");//90
        questionList.add("ബേസ്ബോൾ ഏത് രാജ്യത്താണ് ഉദ്ഭവിച്ചത്");//91
        questionList.add("ഏത് രാജ്യത്തെ പൊലീസ് ആസ്ഥാനമാണ് കോട്ലൻഡ് യാർഡ് എന്നറിയപ്പെടുന്നത്");//92
        questionList.add("ശ്രീനാരായണഗുരു ആരെയാണ് 1925-ൽ പിൻഗാമിയായി നിർദ്ദേശിച്ചത്");//93
        questionList.add("പാരാതെർമോണിന്റെ അളവ് കുറയുന്നത് മൂലമുണ്ടാകുന്ന രോഗം");//94
        questionList.add("മുലപ്പാലുണ്ടാക്കുന്ന ഹോർമോൺ");//95
        questionList.add("ഫ്രാൻസിലും ജർമനിക്കും ഇടയിലുള്ള അതിർത്തിരേഖ");//96
        questionList.add("അജന്താ ഗുഹകൾ കണ്ടെത്തിയ വർഷം");//97
        questionList.add("ബ്രഹ്മസഭ സ്ഥാപിക്കപ്പെട്ട വർഷം");//98
        questionList.add("പദ്മനാഭസ്വാമിക്ഷേത്രം ഏത് രാജ കുടുംബവുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു");//99
        questionList.add("ഇന്ത്യൻ തപാൽ സ്റ്റാമ്പുകൾ അച്ചടിക്കുന്നതെവിടെ");//100
        questionList.add("പദവിയിലിരിക്കെ പ്രസിഡന്റ് അന്തരിച്ചാൽ കാലാവധിയുടെ ശേഷിച്ച കാലത്തേക്ക് വൈസ് പ്രസിഡന്റ് ആ പദവി വഹിക്കാൻ വ്യവസ്ഥയുള്ള രാജ്യം:");//101
        questionList.add("മനുഷ്യശരീരത്തിലെ ഏറ്റവും നീളം കൂടിയ പേശിയേത്?");//102
        questionList.add("ചുവന്ന രക്താണുക്കളുടെ ശവപ്പറമ്പ് എന്നറിയപ്പെടുന്ന ശരീരഭാഗം:");//103
        questionList.add("ഫെഡറൽ ഭരണസംവിധാനമുള്ള രാജ്യത്തിന്റെ ഏറ്റവും വലിയ സവിശേഷത:");//104
        questionList.add("എവിടെ മനസ്സ് ഭയരഹിതമാകുന്നുവോ അവിടെ ശിരസ്സ് ഉന്നത മാകും-ആരുടെ വാക്കുകൾ?");//105
        questionList.add("ഭരണഘടനയുടെ ഹൃദയവും ആത്മാവും എന്ന് ഡോ.അംബേദ് കർ വിശേഷിപ്പിച്ച അനുച്ഛേദം ഏത്?");//106
        questionList.add("ഭൂദാന പ്രസ്ഥാന'ത്തിന്റെ ഉപജ്ഞാതാവ്?");//107
        questionList.add("കൂനൻകുരിശു പ്രതിജ്ഞ' നടന്ന വർഷം:");//108
        questionList.add("ക്യാബിനിറ്റ് മിഷനെ' (1946) നയിച്ചത്:");//109
        questionList.add("ക്യൂണിഫോം' എന്ന ലിപി ഉപയോഗിച്ചിരുന്ന ജനത്?");//110
        questionList.add("ശ്രീനാരായണഗുരു അരുവിപ്പുറത്ത് ശിവലിംഗ പ്രതിഷ്ഠ നടത്തിയ വർഷം:");//111
        questionList.add("ഉത്തരാർധഗോളത്തിലെ ഏറ്റവും ദൈർഘ്യമേറിയ പകൽ:");//112
        questionList.add("അവനവനാത്മസുഖത്തിനാചരിപ്പവയപരന്നു സുഖത്തിനായി വരേണം' ഇപ്രകാരം ഉദ്ബോധിപ്പിച്ചത്: ");//113
        questionList.add("1878 ൽ പ്രസിദ്ധീകരണമാരംഭിച്ച പ്രതം:");//114
        questionList.add("കെ.പി.കേശവമേനോന്റെ 'ബിലാത്തിവിശേഷം' എന്ന യാത്രാവിവരണത്തിൽ ഏതു രാജ്യത്തെക്കുറിച്ചാണ് വിവരിക്കുന്നത്?");//115
        questionList.add("യൂഫ്രട്ടീസ്, ടൈഗ്രിസ് നദികൾക്കിടയിൽ വികാസം പ്രാപിച്ച സംസ്കാരമാണ്:");//116
        questionList.add("ഏറ്റവും കൂടുതൽ കാലം രാഷ്ട്രപതിസ്ഥാനമലങ്കരിച്ച വ്യക്തി:");//117
        questionList.add("റഷ്യയിലെ ഫെബ്രുവരി വിപ്ലവത്തെത്തുടർന്ന് നിക്കോളാസ് രണ്ടാമൻ സ്ഥാനഭ്രഷ്ടനാക്കപ്പെട്ടപ്പോൾ താൽക്കാലിക ഗവൺമെന്റി ന് നേതൃത്വം നൽകിയത്:");//118
        questionList.add("ലാവാശിലകൾ പൊടിഞ്ഞു രൂപം കൊള്ളുന്ന മണ്ണ്");//119
        questionList.add("ലിഖിത ഭരണഘടനയുള്ള രാജ്യത്തിന് ഉദാഹരണമല്ലാത്തത് ഏത്?");//120
        questionList.add("പൊതുതിരഞ്ഞെടുപ്പിൽ വോട്ടുചെയ്യാൻ ഇന്ത്യൻ പൗരനാവശ്യമായ കുറഞ്ഞ പ്രായം:");//121
        questionList.add("ദക്ഷിണേന്ത്യ ആക്രമിച്ച ആദ്യത്തെ മുസ്ലിം ഭരണാധികാരി:");//122
        questionList.add("തിരുവനന്തപുരത്ത് ചാലക്കമ്പോളം സ്ഥാപിച്ചത്?");//123
        questionList.add("ഇന്ത്യയിലെ യുറേനിയം ഖനി:");//124
        questionList.add("ആധുനിക പ്ലാസ്റ്റിക് സർജറി യുടെ പിതാവ്' എന്നറിയപ്പെടുന്നത്:");//125
        questionList.add("അതിചാലകത കണ്ടുപിടിച്ചതാര്?");//126
        questionList.add("സാർവദേശീയ മനുഷ്യാവകാശ പ്രഖ്യാപനം നടത്തിയ വർഷം");//127
        questionList.add("ഗാന്ധിജി വിഭാവനം ചെയ്ത മാതൃകാ രാജ്യമാണ്");//128
        questionList.add("ഗാന്ധിജി ദക്ഷിണാഫ്രിക്കയിൽ ജീവിച്ച കാലം:");//129
        questionList.add("സിന്ധുവിന്റെ പോഷകനദി ഏത്?");//130
        questionList.add("സൂയസ് കനാൽ ദേശസാൽക്കരിച്ച വർഷം:");//131
        questionList.add("സൂര്യന്റെ നമുക്ക് കാണാൻ കഴിയുന്ന ഭാഗമാണ്");//132
        questionList.add("ഭരണഘടനാ വ്യവസ്ഥ പ്രകാരം ലോക്സഭയുടെ പരമാവധി അംഗത്വം:");//133
        questionList.add("ബദൽ നൊബേൽ സമ്മാനം' എന്നറിയപ്പെടുന്നത്.");//134
        questionList.add("മാതംഗലീല' ഏതു മൃഗത്തെ സംബന്ധിച്ച ഗ്രന്ഥമാണ്?");//135
        questionList.add("എബ്രഹാം ലിങ്കൺ അമേരിക്കയുടെ എത്രാമത്തെ പ്രസിഡന്റാണ്?");//136
        questionList.add("ഏതെങ്കിലുമൊരു ഇന്ത്യൻ സംസ്ഥാനത്ത് ഗവർണർ പദവി വഹിച്ച ആദ്യ മലയാളി");//137
        questionList.add("അമേരിക്കൻ മോഡൽ അറബിക്കടലിൽ' എന്ന മുദ്രാവാക്യം ഏത് സമരവുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//138
        questionList.add("അംഗ', 'പൂർവ' എന്നിവ ഏതു മതത്തിന്റെ വിശുദ്ധ ഗ്രന്ഥമാണ്?");//139
        questionList.add("പ്രാതിനിധ്യമില്ലാതെ നികുതിയില്ല' ഈ മുദ്രാവാക്യം ഏതു വിപ്ലവുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//140
        questionList.add("യൂറോപ്പിലെ രോഗി' എന്നു വിളിക്കപ്പെട്ട രാജ്യം?");//141
        questionList.add("രണ്ടാം ബർദോളി' എന്നറിയപ്പെട്ട കേരളത്തിലെ സ്ഥലം");//142
        questionList.add("വയനാട് ജില്ലയുടെ ആസ്ഥാനം:");//143
        questionList.add("ചിക്കുൻ ഗുനിയ എന്ന രോഗത്തിനു കാരണമായ അണു:");//144
        questionList.add("ഒന്നാം പഞ്ചവത്സര പദ്ധതിയിൽ പ്രാമുഖ്യം നൽകപ്പെട്ടത്:");//145
        questionList.add("പാകിസ്താൻ' എന്ന വാക്കിന്റെ ഉപജ്ഞാതാവ്:");//146
        questionList.add("ലോകത്തിലെ ഏറ്റവും ഉയരം കൂടിയ പർവതനിര:");//147
        questionList.add("മിന്നൽ രക്ഷാചാലകം' കണ്ടുപിടിച്ചതാര്?");//148
        questionList.add("കട്ടക് നഗരം ഏതുനദിയുടെ തീരത്താണ്?");//149
        questionList.add("കേരളത്തിൽ തുലാവർഷം അനുഭവപ്പെടുന്നതെപ്പോൾ?");//150
        questionList.add("ഏത് ഊഷ്മാവിലാണ് തെർമോമീറ്ററിൽ സെന്റീഗ്രേഡ് കൈയിലും ഫാരൻഹീറ്റ് കെയിലും തുല്യമാകുന്നത്?");//151
        questionList.add("മംഗോളിസ'ത്തിന്റെ മറ്റൊരു പേര്:");//152
        questionList.add("ഈഴവ മെമ്മോറിയലിനു' നേതൃത്വം നൽകിയത്:");//153
        questionList.add("ഉട്ടോപ്പിയ' രചിച്ചത്?");//154
        questionList.add("വലിയ കുളം' അഥവാ 'ഗ്രേറ്റ് ബാത്ത് എവിടെയാണ് കണ്ടെത്തിയത് ഏത് സ്ഥലത്താണ്?");//155
        questionList.add("വാർധാ പദ്ധതി' എന്തുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//156
        questionList.add("ലാപ് ടോപ് കംപ്യൂട്ടർ' കണ്ടുപിടിച്ചത്:");//157
        questionList.add("സാർക്കോമ' ബാധിക്കുന്ന ശരീരഭാഗം:");//158
        questionList.add("ജൈവ ഘടികാരം' എന്നറിയപ്പെടുന്ന ഗ്രന്ഥി:");//159
        questionList.add("ദൈവം സ്നേഹിക്കുന്നവർ ചെറുപ്പത്തിലേ മരിക്കുന്നു' എന്നു പ്റഞ്ഞത്:");//160
        questionList.add("പമ്പാനദി ഏതു കായലിലാണ് പതിക്കുന്നത്?");//161
        questionList.add("പുരാതന ഒളിമ്പിക്സിലെ ആദ്യ വിജയി:");//162
        questionList.add("ബഹിരാകാശയാത്രികയായ ആദ്യ ഇന്ത്യൻ വംശജ");//163
        questionList.add("ബാബറുടെ ശവകുടീരം എവിടെയാണ്?");//164
        questionList.add("ഭൂമിയുടെ ഏറ്റവും അടുത്തുള്ള ആകാശ ഗോളം:");//165
        questionList.add("മലബാർ കലാപ കാലത്ത് ഭരണാധികാരിയായി അവരോധിക്കപ്പെട്ടത്");//166
        questionList.add("റബ്ബറുൽപാദനത്തിൽ ഒന്നാം സ്ഥാനമുള്ള ജില്ല:");//167
        questionList.add("വിജ്ഞാനത്തിന്റെ പ്രതീകമായി കണക്കാക്കപ്പെടുന്ന പക്ഷി:");//168
        questionList.add("സമ്പൂർണ സാക്ഷരത കൈവരിച്ച ഇന്ത്യയിലെ ആദ്യ ജില്ല:");//169
        questionList.add("ഗാന്ധി സമാധാന സമ്മാനത്തിന് ആദ്യമായി അർഹനായത്:");//170
        questionList.add("പച്ച ഗ്രഹം' എന്നറിയപ്പെടുന്നത്:");//171
        questionList.add("കഥകളി'യുടെ ഉപജ്ഞാതാവ്:");//172
        questionList.add("ജുഡീഷ്യൽ റിവ്യൂ' എന്ന ആശയം ഏതു രാജ്യത്തിൽ നിന്നാണ് ഇന്ത്യ സ്വീകരിച്ചത്?");//173
        questionList.add("പദവിയിലിരിക്കെ അന്തരിച്ച ആദ്യ കേരള ഗവർണർ: ");//174
        questionList.add("ഫ്രഞ്ചു വിപ്ലവ' വുമായി ബന്ധപ്പെട്ട സന്ദേശം:");//175
        questionList.add("മലബാർ മാന്വൽ' രചിച്ചത്?");//176
        questionList.add("മലയാളി മെമ്മോറിയലിനു' നേതൃത്വം നൽകിയത്.");//177
        questionList.add("അഷ്ടപ്രധാൻ' ആരെയാണ് ഭരണകാര്യങ്ങളിൽ സഹായിച്ചത്?");//178
        questionList.add("മുഗൾ ഭരണസമ്പ്രദായത്തിന്റെ ശിൽപി' എന്നറിയപ്പെടുന്നത്?");//179
        questionList.add("അടുക്കളയിൽ നിന്ന് അരങ്ങത്തേക്ക്' രചിച്ചത്");//180
        questionList.add("സംസ്ഥാന വനിതാ കമ്മിഷന്റെ ആദ്യ അധ്യക്ഷ:");//181
        questionList.add("ചുണ്ടൻ വള്ളങ്ങളുടെ നിർമാണത്തിനുപയോഗിക്കുന്ന തടി:");//182
        questionList.add("കംപ്യൂട്ടറിന്റെ പിതാവ്' എന്നറിയപ്പെടുന്നത്:");//183
        questionList.add("വിമോചന സമരം' ഏതു വർഷമായിരുന്നു?");//184
        questionList.add("കറുപ്പുയുദ്ധ'ത്തിൽ ഏറ്റുമുട്ടിയ രാജ്യങ്ങൾ:");//185
        questionList.add("കാർഗിൽ യുദ്ധം' നടന്ന വർഷം:");//186
        questionList.add("സപ്തശൈലനഗരം' എന്നറിയപ്പെട്ട നഗരം:");//187
        questionList.add("സയന്റിഫിക് സോഷ്യലിസ'ത്തിന്റെ ഉപജ്ഞാതാവ്");//188
        questionList.add("സിയോണിസ്റ്റ് പ്രസ്ഥാന'ത്തിന്റെ ഫലമായി രൂപംകൊണ്ട് രാജ്യം:");//189
        questionList.add("പാസ്പറൈസേഷൻ' താഴെപ്പറയുന്നവയിൽ ഏതുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//190
        questionList.add("ഒന്നുകിൽ ഞാൻ ലക്ഷ്യം നേടി തിരിച്ചുവരും. പരാജയപ്പെട്ടാൽ ഞാനെന്റെ ജഡം സമുദ്രത്തിന് സംഭാവന നൽകും ' ഏതവസര ത്തിലാണ് ഗാന്ധിജി ഇങ്ങനെ പറഞ്ഞത്?");//191
        questionList.add("ഭരണഘടനയുടെ രക്ഷാധികാരി' എന്നറിയപ്പെടുന്നത്:");//192
        questionList.add("ഗ്രാമി അവാർഡ് ഏത് മേഖലയുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//193
        questionList.add("ഫെഡറൽ സംവിധാനത്തിന്റെ സംരക്ഷകൻ' എന്നറിയപ്പെടുന്നത്.");//194
        questionList.add("ഹൈഡ്രേറ്റഡ് അയൺ ഓക്സൈഡ്' സാധാരണമായി അറിയപ്പെടുന്നത്:");//195
        questionList.add("ബുദ്ധമതക്കാർ ഏറ്റവും പരിപാവനമായി കണക്കാക്കുന്ന സ്ഥലം:");//196
        questionList.add("ക്ഷയരോഗത്തിനു കാരണമായ രോഗാണു: ");//197
        questionList.add("ആദ്യമായി ശസ്ത്രക്രിയയിലൂടെ മാറ്റിവെച്ച മനുഷ്യാവയവം:");//198
        questionList.add("ഏറ്റവും കൂടുതൽ സംസാരിക്കപ്പെടുന്ന ദ്രാവിഡഭാഷ:");//199
        questionList.add("വിനാഗിരിയിലുള്ള ആസിഡ്:");//200
        questionList.add("കണ്ണൂരിലെ സെന്റ് ആഞ്ജലോ കോട്ട നിർമിച്ചത്:");//201
        questionList.add("ഖരോഷ്ടി' എന്നാൽ പ്രാചീന ഇന്ത്യയിലെ ഒരു ---- ആണ്:");//202
        questionList.add("കേരള സർവകലാശാലയുടെ ആസ്ഥാനം:");//203
        questionList.add("കേരള സാഹിത്യ അക്കാദമിയുടെ പ്രഥമ ഉപാധ്യക്ഷൻ:");//204
        questionList.add("ഗുരുവായൂർ സത്യാഗ്രഹ'ത്തിന്റെ വോളന്റിയർ ക്യാപ്റ്റനായിരുന്നത്.");//205
        questionList.add("ഹരിക്കേൻസ്' എന്നു പേരുള്ള ചുഴലിക്കാറ്റ് എവിടെയാണ് വീശുന്നത്?");//206
        questionList.add("ഹാലിയുടെ ധൂമകേതു' ഏറ്റവുമൊടുവിൽ പ്രത്യക്ഷപ്പെട്ട വർഷം:");//207
        questionList.add("ചിറാപൂഞ്ചി' ഏതു സംസ്ഥാനത്താണ്?");//208
        questionList.add("ഫെറൽ നിയമം' എന്തുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//209
        questionList.add("തെക്കേ അമേരിക്കയിലെ ജോർജ് വാഷിങ്ടൺ' എന്നറിയപ്പെട്ടത്");//210
        questionList.add("ബോക്സർ ലഹള' ഏതു രാജ്യത്താണ് നടന്നത്?");//211
        questionList.add("ആയ്' രാജാക്കൻമാരുടെ തലസ്ഥാനമായിരുന്നത്.");//212
        questionList.add("കണ്ണമ്മൂല' എന്ന സ്ഥലത്ത് ജനിച്ചത്:");//213
        questionList.add("ചിലപ്പതികാര'ത്തിലെ നായകൻ:");//214
        questionList.add("ഗോൾഡൻ ഗ്രാൻഡ്സ്ലാം' നേടിയ ഏകവനിത;");//215
        questionList.add("ബംഗ്ലാദേശിന്റെ സ്വാതന്ത്യത്തിനായി പോരാടിയ ജനകീയസേന:");//216
        questionList.add("മലയാളഭാഷ ആദ്യമായി അച്ചടിക്കപ്പെട്ടത് ഏതു ഗ്രന്ഥത്തിൽ?");//217
        questionList.add("ആവർത്തനപ്പട്ടികയിലെ ഏറ്റവും ഭാരം കുറഞ്ഞ മൂലകം:");//218
        questionList.add("ഇന്ത്യൻ ആണവോർജകമ്മീഷന്റെ ആദ്യ അധ്യക്ഷൻ:");//219
        questionList.add("ഇന്ദിരാഗാന്ധി വധിക്കപ്പെട്ടതെന്ന്?");//220
        questionList.add("എല്ലാ ഗ്രാമങ്ങളും വൈദ്യുതീകരിക്കപ്പെട്ട ആദ്യ ഇന്ത്യൻ സംസ്ഥാനം:");//221
        questionList.add("ഏതു മതവിഭാഗമാണ് ലക്ഷദ്വീപിൽ ഏറ്റവും കൂടുതലുള്ളത്?");//222
        questionList.add("ഹൈദരാബാദിനെയും സെക്കന്തരാബാദിനേയും വേർതിരിക്കുന്ന തടാകം");//223
        questionList.add("കേരളത്തിൽ നിലക്കടല ഏറ്റവും കൂടുതൽ ഉല്പാദിപ്പിക്കുന്ന ജില്ല:");//224
        questionList.add("കേരളത്തിലെ മരുമക്കത്തായ സമ്പ്രദായത്തെക്കുറിച്ച് പ്രതിപാദിക്കുന്ന ആദ്യത്തെ കൃതി:");//225
        questionList.add("കേരളത്തിലെ ആദ്യത്തെ റവന്യൂ മന്ത്രി:");//226
        questionList.add("ചോളൻമാരുടെ തലസ്ഥാനമായിരുന്നത്:");//227
        questionList.add("തിരുവിതാംകൂർ ഭരിച്ച് അവസാനത്തെ രാജാവ്:");//228
        questionList.add("തിരു-കൊച്ചിയിൽ അഞ്ചൽ വകുപ്പ് നിറുത്തലാക്കിയ വർഷം:");//229
        questionList.add("തിരഞ്ഞെടുക്കപ്പെടുന്ന രാഷ്ട്രത്തലവനുള്ള രാജ്യം എന്തു പേരിൽ അറിയപ്പെടുന്നു?");//230
        questionList.add("ഭരണഘടനാപരമായ പരിഹാരങ്ങൾക്ക് ഇന്ത്യൻ ഭരണഘടനയിൽ വ്യവസ്ഥ ചെയ്തിട്ടുള്ള റിട്ടുകളുടെ എണ്ണം:");//231
        questionList.add("1959 ൽ ഇന്ത്യയിൽ ഏതുനഗരത്തിലാണ് ടെലിവിഷൻ സംപ്രക്ഷണം ആദ്യമായി നടത്തിയത് ?");//232
        questionList.add("അന്താരാഷ്ട്ര സിവിൽ വ്യോമയാന സംഘടനയുടെ ആസ്ഥാനം:");//233
        questionList.add("മൂത്രത്തിന്റെ മഞ്ഞനിറത്തിനു കാരണം:");//234
        questionList.add("മൗലികാവകാശങ്ങൾ നടപ്പാക്കാൻ സുപ്രീം കോടതി എന്താണ് പുറപ്പെടുവിക്കുന്നത്?");//235
        questionList.add("ലോകത്തെ ആദ്യത്തെ സോഷ്യലിസ്റ്റ് രാഷ്ട്രം' എന്നു വിശേഷിപ്പിക്കപ്പെട്ടത്?");//236
        questionList.add("ചോർച്ചാ സിദ്ധാന്തം' ആവിഷ്കരിച്ചത്");//237
        questionList.add("നർമദയ്ക്കും താപ്തിക്കും ഇടയിൽ സ്ഥിതി ചെയ്യുന്നത് ");//238
        questionList.add("നാട്ടുരാജ്യ വകുപ്പിന്റെ സെക്രട്ടറിയെന്ന നിലയിൽ ഇന്ത്യയെ ഏകോപിപ്പിക്കാൻ സർദാർ പട്ടേലിനെ സഹായിച്ച മലയാളി:");//239
        questionList.add("നിയമസഭാംഗങ്ങൾ രാജിവയ്ക്കാനുദ്ദേശിക്കുമ്പോൾ കത്ത് സമർപ്പിക്കേണ്ടത് ആർക്കാണ്?");//240
        questionList.add("നിസ്സഹകരണ പ്രസ്ഥാനം നിറുത്തിവയ്ക്കാൻ ഗാന്ധിജിയെ പ്രരിപ്പിച്ച സംഭവം: ");//241
        questionList.add("നറോറ ആണവനിലയം ഏതു സംസ്ഥാനത്താണ്?");//242
        questionList.add("ആരുടെ മരണത്തിൽ അനുശോചിച്ചുകൊണ്ടാണ് കുമാരനാശാൻ 'പ്രരോദനം' രചിച്ചത്?");//243
        questionList.add("ഇന്ത്യയിൽ ഏറ്റവും കൂടുതൽ ചന്ദനമരങ്ങൾ കാണപ്പെടുന്നത് ഏത് സംസ്ഥാനത്താണ്?");//244
        questionList.add("എം.ജി.സർവകലാശാല വൈസ് ചാൻസലറായിരുന്ന ജ്ഞാനപീഠജേതാവ്:");//245
        questionList.add("ഒരു ഒളിമ്പിക്സിൽ ആറു സ്വർണം നേടിയ ആദ്യ വനിത:");//246
        questionList.add("കേരള നിയമസഭയിലെ ആദ്യത്തെ ആംഗ്ലോ-ഇന്ത്യൻ പ്രതിനിധി:");//247
        questionList.add("ഏറ്റവും കൂടുതൽ ഗ്രാമങ്ങളുള്ള ഇന്ത്യൻ സംസ്ഥാനം:");//248
        questionList.add("ഗുഡ്ഗാവ്' വ്യവസായമേഖല ഏതുസംസ്ഥാനത്താണ്?");//249
        questionList.add("രാഷ്ട്രപതി തിരഞ്ഞെടുപ്പിൽ വോട്ടു ചെയ്യുന്ന ആകെ പാർലമെന്റംഗങ്ങൾ:");//250
        questionList.add("സൂര്യനോട് ഏറ്റവും അടുത്തു സ്ഥിതി ചെയ്യുന്ന നക്ഷത്രം");//251
        questionList.add("ഹരിതവിപ്ലവം' ആരംഭിച്ചത് ഏതുരാജ്യത്താണ്?");//252
        questionList.add("കായിക്കര' എന്ന സ്ഥലത്ത് ജനിച്ചത്:");//253
        questionList.add("സർദാർ സരോവർ പദ്ധതി' ഏതു നദിയിലാണ്?");//254
        questionList.add("സുപ്രീം കോടതി ജഡ്ജിയായ ആദ്യ മലയാളി:");//255
        questionList.add("ഫുട്ബോൾ സംഘടനയായ 'ഫിഫ'യുടെ ആസ്ഥാനം:");//256
        questionList.add("റാണിഗഞ്ച്' കൽക്കരിപ്പാടം ഏതു സംസ്ഥാനത്താണ്?");//257
        questionList.add("മെസൊപൊട്ടാമിയ' ഏതു രാജ്യത്തിന്റെ പഴയ പേരാണ്?");//258
        questionList.add("ഭരണഘടനയുടെ ആമുഖം ഇതുവരെ എത്ര പ്രാവശ്യം ഭേദഗതി ചെയ്തിട്ടുണ്ട്?");//259
        questionList.add("മനുഷ്യപുംബീജങ്ങളിലെ കാമസോം നമ്പർ എത്ര?");//260
        questionList.add("മനുഷ്യന്റെ ശാസ്ത്രനാമം:");//261
        questionList.add("ആദ്യത്തെ വള്ളത്തോൾ അവാർഡ് നേടിയത്:");//262
        questionList.add("ഇന്ത്യയിലെ ദ്വിതീയ പൗരൻ എന്നറിയപ്പെടുന്നത്:");//263
        questionList.add("ഉപഗ്രഹ വിക്ഷേപണസ്ഥലമായ ശ്രീഹരിക്കോട്ട ഏതു സംസ്ഥാനത്ത് സ്ഥിതി ചെയ്യുന്നു?");//264
        questionList.add("ഏതു വംശത്തിലെ രാജാവായിരുന്നു ബിംബിസാരൻ?");//265
        questionList.add("അബിസീനിയ'ഇപ്പോൾ എന്തുപേരിൽ അറിയപ്പെടുന്നു?");//266
        questionList.add("ഓസ്കർ നോമിനേഷൻ നേടിയ ആദ്യ ഇന്ത്യൻ ചിത്രം:");//267
        questionList.add("മോണയെ ബാധിക്കുന്ന രോഗമാണ്.");//268
        questionList.add("സോഡിയം വേപ്പർ ലാമ്പ് ഏതുനിറത്തിൽ പ്രകാശിക്കും?");//269
        questionList.add("ബയോളജി' എന്ന വാക്ക് രൂപവൽക്കരിച്ചത്:");//270
        questionList.add("ദ്രാവിഡ കഴകം' സ്ഥാപിച്ചത്.");//271
        questionList.add("അൽഷിമേഴ്സ് രോഗം' ഏതവയവത്തെയാണ് ബാധിക്കുന്നത്?");//272
        questionList.add("കൂട്ടുത്തരവാദിത്വം' എന്ന ആശയം ഏതു രാജ്യത്തുനിന്നുമാണ് ഇന്ത്യൻ ഭരണഘടനാനിർമാതാക്കൾ സ്വീകരിച്ചത്?");//273
        questionList.add("പ്രതസ്വാതന്ത്ര്യത്തിനു ബാധകമായ ഭരണഘടനാ അനുച്ഛേദം:");//274
        questionList.add("ഭൂസ്ഥിര ഉപഗ്രഹങ്ങളുടെ പ്രദക്ഷിണപഥം എത്ര കിലോമീറ്റർ ഉയരത്തിലാണ് സ്ഥിതിചെയ്യുന്നത്?");//275
        questionList.add("അന്തരീക്ഷമില്ലായെങ്കിൽ ആകാശത്തിന്റെ നിറമെന്തായിരിക്കും?");//276
        questionList.add("അമിതമായി ജലം മൂത്രത്തിലൂടെ പുറന്തള്ളപ്പെടുന്ന അവസ്ഥയാണ്.");//277
        questionList.add("ആരുടെ ഔദ്യോഗിക വസതിയാണ് 'രാജ്ഭവൻ' എന്നറിയപ്പെടുന്നത്?");//278
        questionList.add("ആസ്പിരിനിന്റെ രാസനാമം:");//279
        questionList.add("ആദ്യമായി ഹൈഡ്രജൻ ബോംബ് പരീക്ഷിച്ച രാജ്യം:");//280
        questionList.add("കാന്തമുണ്ടാക്കാനുപയോഗിക്കുന്ന ലോഹസങ്കരം:");//281
        questionList.add("പെട്രോളിയത്തിന്റെ അസംസ്കൃതരൂപം:");//282
        questionList.add("കേരളത്തിലെ ഏറ്റവും നീളം കൂടിയ നദി?:");//283
        questionList.add("തിരുവിതാംകൂറിൽ ശ്രീമൂലം പ്രജാസഭ(പോപ്പുലർ അസംബ്ളി) പ്രവർത്തനമാരംഭിച്ച വർഷം:");//284
        questionList.add("തീ ഗോർജസ്' അണക്കെട്ട് ഏതു രാജ്യത്താണ്?");//285
        questionList.add("രാംനാഥ് ഗോയങ്ക അവാർഡ്' ഏതു മേഖലയുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//286
        questionList.add("എപ്പോഴും മുന്നോട്ട്' ഏതു കായികോൽസവത്തിന്റെ മുദ്രാവാക്യമാണ്?");//287
        questionList.add("കാൻഫെഡ്' (കേരള അസോസിയേഷൻ ഫോർ നോൺ ഫോർമൽ എഡ്യൂക്കേഷൻ) സ്ഥാപിച്ചത്");//288
        questionList.add("ഗൗളീഗാതം' ഏതു കാർഷിക വിളയുടെ ഇനമാണ്?");//289
        questionList.add("ഭരണഘടനയുടെ 'പീഠിക' തയ്യാറാക്കിയതാര്?");//290
        questionList.add("ദ്രവ്യത്തിന്റെ ആറാമത്തെ അവസ്ഥ:");//291
        questionList.add("1955നു മുമ്പ് സ്റ്റേറ്റ് ബാങ്ക് ഓഫ് ഇന്ത്യയുടെ പേര്");//292
        questionList.add("മനുഷ്യർ ഒരു മിനിറ്റിൽ ശരാശരി എത്ര പ്രാവശ്യം ശ്വസിക്കുന്നു?");//293
        questionList.add("അന്തരീക്ഷത്തിൽ കാർബൺ ഡൈ ഓക്സൈഡിന്റെ ശരാശരി അളവ് എത്രശതമാനമാണ്");//294
        questionList.add("ഇന്ത്യയിലാദ്യമായി 1960ൽ എസ്.ടി.ഡി. സംവിധാനത്തിലൂടെ ബന്ധപ്പെടുത്തിയ നഗരങ്ങൾ:");//295
        questionList.add("ഏതു സംസ്ഥാനത്ത് പ്രചാരമുള്ള അനുഷ്ഠാന നൃത്തരൂപമാണ്ഗാർബ?");//296
        questionList.add("ഏതു സേനയുടെ തലവനാണ് അഡ്മിറൽ");//297
        questionList.add("കൊച്ചിയിലെ അവസാനത്തെ പ്രധാനമന്ത്രി:");//298
        questionList.add("മോണ്ടിനെഗ്രാ ഏതു രാജ്യത്തിൽനിന്നാണ് സ്വാതന്ത്യം നേടിയത്?");//299
        questionList.add("പൂക്കളുടെ താഴ്വര' ഏതു സംസ്ഥാനത്താണ്?");//300
        questionList.add("ബംഗ്' ഏതു സംസ്ഥാനത്തെ നൃത്തരൂപമാണ്?");//1
        questionList.add("യൂറോപ്പിന്റെ പടക്കളം' എന്നറിയപ്പെടുന്ന രാജ്യം:");//2
        questionList.add("റിബോഫ്ളാവിൻ' ഏതു വിറ്റാമിന്റെ രാസനാമം:");//3
        questionList.add("വൾക്കനൈസേഷൻ' നടത്തുമ്പോൾ റബ്ബറിൽ ചേർക്കുന്നത്:");//4
        questionList.add("ലോറസ് അവാർഡ്' ഏതു രംഗവുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//5
        questionList.add("പിതാവിനെ വധിച്ച് അധികാരമേറ്റ രാജാവ്?");//6
        questionList.add("ഭരണഘടനയുടെ ഏതു ഭാഗത്താണ് 'മൗലിക ചുമതലകൾ' ഉൾ പ്പെടുത്തിയിരിക്കുന്നത്?");//7
        questionList.add("കൂഫെൽറ്റ്-ജേക്കബ് രോഗത്തിന്റെ മറ്റൊരു പേര്:");//8
        questionList.add("അന്തരീക്ഷത്തിലെ ഏതു പാളിയിലാണ് ഓസോൺ ഉള്ളത്?");//9
        questionList.add("മീനച്ചിലാർ ഏതു ജില്ലയിലെ പ്രധാനനദിയാണ്?");//10
        questionList.add("ഏറ്റവും വേഗത്തിൽ വളരുന്ന പുൽവർഗസസ്യം:");//11
        questionList.add("പരുത്തിക്കുഷിക്ക് അനുയോജ്യമായ മണ്ണ്:");//12
        questionList.add("പലസ്തീൻ വിമോചന സംഘടന രൂപം കൊണ്ട് വർഷം:");//13
        questionList.add("ബി.സി.ആറാം ശതകത്തിൽ ഉത്തരേന്ത്യയിലുണ്ടായിരുന്ന മഹാജനപദങ്ങളിൽ ഏറ്റവും പ്രബലം?");//14
        questionList.add("ബംഗാളിൽ ദ്വിഭരണം നടപ്പിൽ വരുത്തിയത്");//15
        questionList.add("ബംഗാളിലെ ഭക്തിപ്രസ്ഥാനത്തിനു രൂപം നൽകിയത്:");//16
        questionList.add("ഏതു വിളയെ ബാധിക്കുന്ന രോഗമാണ് ദ്രുതവാട്ടം?");//17
        questionList.add("കലിക്കറ്റ് സർവകലാശാലയുടെ പ്രഥമ വൈസ് ചാൻസലർ:");//18
        questionList.add("കേരള സ്റ്റേറ്റ് ബാംബു കോർപ്പറേഷന്റെ ആസ്ഥാനം:");//19
        questionList.add("ദേശീയോദ്ഗ്രഥനത്തിനുള്ള ഇന്ദിരാഗാന്ധി അവാർഡ് ആദ്യമായി നേടിയത്:");//20
        questionList.add("അയിത്തോച്ചാടനനിയമം പാർലമെന്റ് പാസാക്കിയ വർഷം:");//21
        questionList.add("സ്നെല്ലൻസ് ചാർട്ട് എന്തു പരിശോധിക്കാൻ ഉപയോഗിക്കുന്നു?");//22
        questionList.add("നിയമവിരുദ്ധമായ നടപടികൾ കണ്ടാൽ സ്വയം കേസെടുക്കാൻ മജിസ്ട്രേറ്റിന് അധികാരം നൽകുന്ന വകുപ്പ്:");//23
        questionList.add("പ്രസിഡന്റിനെ പദവിയിൽ നിന്ന് നീക്കംചെയ്യുന്ന നടപടി?");//24
        questionList.add("ഇന്ത്യയിൽനിന്നുമുള്ളവർക്ക് മിസ് യൂണിവേഴ്സസ്, മിസ് വേൾഡ് പട്ടങ്ങൾ ഒരുമിച്ച് ലഭിച്ച വർഷം?");//25
        questionList.add("ഇന്ത്യയിലെ ആദ്യത്തെ സംസ്ഥാന മലിനീകരണ നിയന്ത്രണബോർഡ് എവിടെയാണ് സ്ഥാപിക്കപ്പെട്ടത്?");//26
        questionList.add("ഏതു ലോഹത്തിന്റെ അയിരാണ് ഗലീന?");//27
        questionList.add("ഒന്നാം ലോകമഹായുദ്ധത്തിനും രണ്ടാം ലോകമഹായുദ്ധത്തിനും ഇടയിലുള്ള ഇടവേള എത്ര വർഷം?");//28
        questionList.add("ഖരാവസ്ഥയിൽനിന്നും ദ്രാവകമാകാതെ നേരിട്ട് വാതകമാകുന്ന പ്രക്രിയ?");//29
        questionList.add("സഫേദ് മുസ്ലിയുടെ ഏതു ഭാഗമാണ് ഔഷധനിർമാണത്തിന് ഉപയോഗിക്കുന്നത്?");//30
        questionList.add("സൗരയൂഥം ഉൾപ്പെടുന്ന ഗാലക്സിയുടെ പേര്?");//31
        questionList.add("ചലിപ്പിക്കാൻ കഴിയുന്ന, മുഖത്തെ ഏക അസ്ഥി");//32
        questionList.add("കേരളത്തിൽ എവിടെയാണ് സെന്റ് ആഞ്ചലോ കോട്ട?");//33
        questionList.add("ജോൺ രാജാവ് മാഗ്നകാർട്ടയിൽ ഒപ്പുവെച്ച വർഷം?");//34
        questionList.add("മൂർത്തിദേവി അവാർഡ്' ഏതു മേഖലയിലാണ് നൽകുന്നത്?");//35
        questionList.add("ആരുടെ ചരമദിനമാണ് 'വായനാദിന'മായി ആചരിക്കുന്നത്?");//36
        questionList.add("ലോകത്തിലെ ഏറ്റവും ഉയരം കൂടിയ കൊടുമുടി:");//37
        questionList.add("തത്ത്വചിന്തകനായ ഇന്ത്യൻ പ്രസിഡന്റ്' എന്നറിയപ്പെട്ടത്:");//38
        questionList.add("ഐക്യരാഷ്ട്രസഭയുടെ ആസ്ഥാനം:");//39
        questionList.add("ഏതു നേതാവിന്റെ ഉപദേശപ്രകാരമാണ് കെ.കേളപ്പൻ ഗുരുവായുരിലെ സത്യാഗ്രഹം അവസാനിപ്പിച്ചത്?");//40
        questionList.add("പുരാതന ഇന്ത്യയിലെ, ഹോസ്റ്റൽ സംവിധാനമുണ്ടായിരുന്ന ആദ്യ സർവകലാശാല:");//41
        questionList.add("ദേശീയ മനുഷ്യാവകാശ കമ്മിഷന്റെ പ്രഥമ ചെയർമാൻ:");//42
        questionList.add("ബോർഡോ മിശ്രിതം കണ്ടുപിടിച്ചതാര്?");//43
        questionList.add("കോട്ടുക്കോണം' ഏതു വിളയുടെ ഇനമാണ്?");//44
        questionList.add("ഭൂഗോളത്തിന്റെ ആകെ വിസ്തീർണത്തിന്റെ എത്ര ശതമാനമാണ് ഇന്ത്യ?");//45
        questionList.add("ഒരു പ്രാവശ്യം ഹൃദയമിടിക്കുന്നതിനാവശ്യമായ സമയം:");//46
        questionList.add("ഓൾ ഇന്ത്യാ വാർ മെമ്മോറിയൽ' ഇപ്പോൾ എന്തുപേരിലറിയപ്പെടുന്നു?");//47
        questionList.add("ഏതു വംശത്തിലെ ഏറ്റവും പ്രഗത്ഭനായ രാജാവായിരുന്നു രുദ്രദാമൻ?");//48
        questionList.add("താഴെപ്പറയുന്നവയിൽ ഏതാണ് ഗ്ലാസിന് കടുംനീലനിറം നൽകുന്നത്?");//49
        questionList.add("ഭരണഘടനയുടെ എത്രാമത്തെ ഷെഡ്യൂളിലാണ് കേന്ദ്ര-സംസ്ഥാനങ്ങൾ തമ്മിലുള്ള അധികാരവിഭജനം ഏർപ്പെടുത്തുന്ന മൂന്ന് ലിസ്റ്റുകളെക്കുറിച്ച് പ്രതിപാദിച്ചിരിക്കുന്നത്?");//50
        questionList.add("ഭഗീരഥിയും അളകനന്ദയും സന്ധിക്കുന്ന സ്ഥലം");//51
        questionList.add("ഭാഷാടിസ്ഥാനത്തിലുള്ള സംസ്ഥാന പുനസ്സംഘടനാസമയത്ത്തമിഴ്നാടിനോട് ചേർക്കപ്പെട്ട് താലൂക്ക് അല്ലാത്തത്");//52
        questionList.add("ഭൂചലനങ്ങളുടെ തീവത തരംതിരിച്ച ആദ്യശാസ്ത്രജ്ഞൻ:");//53
        questionList.add("കേരള സിവിൽ സപ്ലൈസ് കോർപ്പറേഷന്റെ ആസ്ഥാനം:");//54
        questionList.add("പ്രഥമ ഇ.എം.എസ്.മന്ത്രിസഭയിൽ (1957-59) അംഗമായിരുന്ന താഴെപ്പറയുന്നവരിൽ സ്വതന്ത്രസ്ഥാനാർഥിയല്ലാതിരുന്ന വ്യക്തി:");//55
        questionList.add("ഇന്ത്യയിൽ ഏറ്റവും വടക്കുള്ള തലസ്ഥാന നഗരം:");//56
        questionList.add("പാൻക്രിയാസിന്റെ പ്രവർത്തനത്തെ ബാധിക്കുന്ന രോഗമാണ്.");//57
        questionList.add("എം.ആർ.എഫ്.' ഏത് ഉല്പന്നവുമായി ബന്ധപ്പെട്ടിരിക്കുന്നു?");//58
        questionList.add("അഡിസൺസ് രോഗം' ഏതവയവത്തെ ബാധിക്കുന്നു?");//59
        questionList.add("കേരള സംസ്ഥാനം രൂപവത്കരണത്തിന്റെ 25 വർഷം പൂർത്തിയാക്കിയ 1981 നവംബർ ഒന്നിന് മുഖ്യമന്ത്രി ആരായിരുന്നു?");//60
        questionList.add("വെള്ളം തണുത്തിരിക്കുന്നത് ഏതു തരം പാത്രത്തിൽ സംഭരിക്കുമ്പോഴാണ്?");//61
        questionList.add("പാഴ്സികളുടെ പുരാതന അഗ്നിക്ഷേത്രങ്ങളുള്ള ഉഡ്വാഡ് ഏതു സംസ്ഥാനത്താണ്?");//62
        questionList.add("കുമാരനാശാന്റെ 'വീണപൂവ്' ഏതു പത്രത്തിലാണ് ആദ്യം പ്രസിദ്ധീകരിച്ചത്?");//63
        questionList.add("വൈക്കം മുഹമ്മദ് ബഷീറിന്റെ ആദ്യനോവൽ:");//64
        questionList.add("കൊടൈക്കനാൽ' ഏതു മലനിരകളിലാണ്?");//65
        questionList.add("ഒന്നാം പഞ്ചവത്സരപദ്ധതിയുടെ കാലാവധി:");//66
        questionList.add("ചിറകുകളില്ലാത്ത ഒരു ഷഡ്പദം:");//67
        questionList.add("ഇന്ത്യയുടെ 'ജൊവാൻ ഓഫ് ആർക്ക്' എന്നു വിശേഷിപ്പിക്കുന്നതാരെ?");//68
        questionList.add("മലയാളത്തിലെ ആദ്യത്തെ മഹാകാവ്യമായ 'രാമചന്ദ്രവിലാസം' രചിച്ചതാര്?");//69
        questionList.add("കൃത്രിമമഴ ഉണ്ടാക്കാൻ ഉപയോഗിക്കുന്ന ലവണം:");//70
        questionList.add("പാലിനെ തെരാക്കുന്ന ബാക്ടീരിയ:");//71
        questionList.add("ഡെങ്കിപ്പനി പരത്തുന്നത്:");//72
        questionList.add("മനുഷ്യന്റെ ഒരു വൃക്കയുടെ ശരാശരി ഭാരം---- ഗ്രാം ആണ്:");//73
        questionList.add("സുവർണ മയൂരം' ഏതുമായി ബന്ധപ്പെട്ട അവാർഡാണ്?");//74
        questionList.add("ഇന്ത്യാഗേറ്റ്' രൂപകല്പന ചെയ്തത്:");//75
        questionList.add("പദവിയിലിരിക്കെ അന്തരിച്ച, കേരളത്തിലെ ആദ്യത്തെ മന്ത്രി:");//76
        questionList.add("കാലത്തിന്റെ കപോലത്തിലെ കണ്ണുനീർത്തുള്ളി' എന്ന് താജ്മ ഹലിനെ വിശേഷിപ്പിച്ചത്:");//77
        questionList.add("ഏറ്റവും കൂടുതൽ ജനസാന്ദ്രതയുള്ള കേന്ദ്ര ഭരണ പ്രദേശം:");//78
        questionList.add("താഴെപ്പറയുന്നവയിൽ ഭരണഘടനാപദവിയല്ലാത്തത് ഏത്?");//79
        questionList.add("കാളപ്പോര് ഏതുരാജ്യത്തെ ദേശീയ കായിക വിനോദമാണ്?");//80
        questionList.add("പ്രഥമ ലോകകപ്പ് ക്രിക്കറ്റ് മത്സരത്തിൽ വിജയിച്ച രാജ്യം?");//81
        questionList.add("ഭാരതരത്ന ബഹുമതിക്കർഹനായ വ്യവസായി?");//82
        questionList.add("ഏതു വർഷമാണ് 'സംക്ഷേപവേദാർഥം പ്രസിദ്ധപ്പെടുത്തിയത്?");//83
        questionList.add("ഡെങ്കിപ്പനിക്കു കാരണം ?");//84
        questionList.add("ഇന്ത്യയിലെ ആദ്യത്തെ ജൂതപ്പള്ളി ഏതു സംസ്ഥാനത്താണ് നിർമിക്കപ്പെട്ടത്?");//85
        questionList.add("ശ്രീബുദ്ധൻ ഇഹലോകവാസം വെടിഞ്ഞ സ്ഥലം?");//86
        questionList.add("താൻസൻ സമ്മാനം'നൽകുന്നത് ഏതു സംസ്ഥാനത്തെ ഗവൺമെന്റാണ്?");//87
        questionList.add("കേരള സ്റ്റേറ്റ് ഇലക്ട്രിസിറ്റി ബോർഡ് സ്ഥാപിതമായ വർഷം :");//88
        questionList.add("കോൺസ്റ്റാന്റിനോപ്പിളിന്റെ ഇപ്പോഴത്തെ പേര്:");//89
        questionList.add("യോമിയുരി ഷിംബുൺ' ഏതുരാജ്യത്തെ പത്രമാണ്?");//90
        questionList.add("ഏതു സംസ്ഥാനം വിഭജിച്ചാണ് ജാർഖണ്ഡ് സംസ്ഥാനം രൂപവത്കരിച്ചത്?");//91
        questionList.add("ഇന്ത്യയിൽ മുസ്ലിം ലീഗ് സ്ഥാപിതമായ വർഷം:");//92
        questionList.add("കേരളനിയമസഭയിൽ ഏറ്റവും കൂടുതൽ പ്രാവശ്യം കാസ്റ്റിങ് വോട്ട് പ്രയോഗിച്ച സ്പീക്കർ:");//93
        questionList.add("ദ്വിരാഷ്ട്ര സിദ്ധാന്തം' ആവിഷ്കരിച്ചത്.");//94
        questionList.add("അടിമവംശം സ്ഥാപിച്ചത്");//95
        questionList.add("ഗാന്ധി സമാധാന സമ്മാനത്തിനർഹനായ ആദ്യത്തെ ഭാരതീയൻ");//96
        questionList.add("ഇന്ത്യയിൽ ഏറ്റവും കൂടുതൽ പട്ട് ഉൽപാദിപ്പിക്കുന്ന സംസ്ഥാനം:");//97
        questionList.add("ജ്ഞാനപ്പാന' രചിച്ചത്");//98
        questionList.add("1857ലെ കലാപകാലത്ത് ബ്രിട്ടീഷിന്ത്യയിൽ ഗവർണർ ജനറലായിരുന്നത്");//99
        questionList.add("ഏതു രാജ്യത്തെ ലിപിയായിരുന്നു 'ഹീറോഗ്ലിഫിക്സ്'?");//100



    }

    public String getQuestion(int questionNumber)
    {
        this.questionNumber=questionNumber;
        return questionList.get(questionNumber);
    }
    public int getquestionListLength()
    {
        return questionList.size();
    }

}
