package com.melisa.rincemathew.malayalamgkquiz;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;

public class World extends AppCompatActivity {

    ListView listView;
    android.support.v7.widget.Toolbar toolbar;
    String[] mobileArray = {"ലോകത്തിലെ ഏറ്റവും വലുതും ചെറുതും",
            "ലോകത്തിൽ ഏറ്റവും ആദ്യം","പാർലമെന്റുകൾ","രാഷ്ടങ്ങളും നാണയങ്ങളും"};
    String ministers  = "വലുതും ചെറുതും";
    String ministers1  = "ഏറ്റവും വലിയ ഭൂഖണ്ഡം : ഏഷ്യ\n" +
            "ഏറ്റവും ചെറിയ ഭൂഖണ്ഡം : ആസ്ത്രേലിയ\n" +
            "ഏറ്റവും വലിയ രാജ്യം : റഷ്യ\n" +
            "ഏറ്റവും ചെറിയ രാജ്യം : വത്തിക്കാൻ\n" +
            "ഏറ്റവും വലിയ നദി : ആമസോൺ\n" +
            "ഏറ്റവും വലിയ ദ്വീപ് : ഗ്രീൻലാന്റ് \n" +
            "ഏറ്റവും വലിയ ദ്വീപസമൂഹം : ഇന്തൊനീഷ്യ\n" +
            "ഏറ്റവും വലിയ ഉപദ്വീപ് : അറേബ്യ\n" +
            "ഏറ്റവും വലിയ മരുഭൂമി : സഹാറ\n" +
            "ഏറ്റവും നീളം കൂടിയ നദി : നെൽ\n" +
            "ഏറ്റവും ചെറിയ സമുദം : ആർട്ടിക്\n" +
            "ഏറ്റവും വലിയ സമുദ്രം : ശാന്തസമുദ്രം\n" +
            "ഏറ്റവും വലിയ കൊടുമുടി : എവറസ്റ്റ്\n" +
            "ഏറ്റവും ഉയരം കൂടിയ പീഠഭൂമി : പാമീർസ് (ടിബറ്റ്)\n" +
            "ഏറ്റവും ഉയരം കൂടിയ കെട്ടിടം : ബുർജ് ഖലീഫ (ദുബായ്)\n" +
            "ഏറ്റവും വലിയ ശുദ്ധജല തടാകം :സുപ്പീരിയർ തടാകം \n" +
            "ഏറ്റവും വലിയ കൃത്രിമ തടാകം : മീഡ് തടാകം \n" +
            "ഏറ്റവും കൂടുതൽ ജനസംഖ്യയുള്ള രാജ്യം : ചൈന \n" +
            "ഏറ്റവും കുറവ് ജന സംഖ്യ യുള്ള രാജ്യം : വത്തിക്കാൻ \n" +
            "ഏറ്റവും വലിയ ലവണജല തടാകം : കാസ്പിയൻ കടൽ \n" +
            "ഏറ്റവും ഉയരംകൂടിയ സജീവ അഗ്നിപർവതം;കൊടോപ്സി \n" +
            "ഏറ്റവും ആഴം കൂടിയ വെള്ളച്ചാട്ടം : സാൾട്ടോ എയ്ഞ്ചൽ \n" +
            "ഏറ്റവും വലിയ കടൽ : ദക്ഷിണ ചൈനാ കടൽ \n" +
            "ഏറ്റവും വലിയ തുറമുഖം : ന്യൂയോർക്ക്-ന്യൂ ജേഴ്സി \n" +
            "ഏറ്റവും വലിയ മണി : ഗ്രറ്റ് ബെൽ (മോസ്കോ) \n" +
            "ഏറ്റവും വലിയ കാഴ്ചബംഗ്ലാവ് : നാച്വറൽ ഹിസ്റ്ററിമ്യൂസിയം (അമേരിക്ക) \n" +
            "ഏറ്റവും നീളം കൂടിയ മതിൽ : ചൈനയിലെ വൻമതിൽ \n" +
            "ഏറ്റവും വലിയ അക്വേറിയം : ജോൺ ജി. ഷെഡ് അക്വറിയം \n" +
            "ഏറ്റവും വലിയ സെമിത്തേരി : ഒഹിഡോർട്ട് സെമിത്തേരി \n" +
            "ഏറ്റവും വലിയ ജീവി : നീലത്തിമിംഗലം\n" +
            "ഏറ്റവും വലിയ ജീവി (കര) : ആഫ്രിക്കൻ ആന\n" +
            "ഏറ്റവും വലിയ ക്ഷേത്രം : അങ്കോർവാത്ത് (കംബോഡിയ)\n" +
            "ഏറ്റവും വലിയ പള്ളി : സെന്റ് പീറ്റേഴ്സ് ബസലിക്ക\n" +
            "ഏറ്റവും ഉയരമുള്ള പർവതനിര : ഹിമാലയം\n" +
            "ഏറ്റവും വേഗതയുള്ള മൃഗം : പുള്ളിപ്പുലി\n" +
            "ഏറ്റവും ഉയരം കൂടിയ മൃഗം : ജിറാഫ്\n" +
            "ഏറ്റവും വലിയ പുഷ്പം : റഫ്ളേഷ്യ\n" +
            "ഏറ്റവും വലിയ പക്ഷി : ഒട്ടകപ്പക്ഷി\n" +
            "ഏറ്റവും വേഗത കൂടിയ ജീവി : ഫാൽക്കൺ\n" +
            "ഏറ്റവും ഉയരമുള്ള ഗോപുരം: സി.എൻ. ടവർ\n" +
            "ഏറ്റവും വലിയ ഡെൽറ്റ : സുന്ദർബൻസ്\n" +
            "ഏറ്റവും വലിയ അണക്കെട്ട് : ഗ്രാന്റ് കൂളി (യു.എസ്.എ.) \n" +
            "ഏറ്റവും നീളം കൂടിയ റോഡ് : പാൻ അമേരിക്കൻ ഹൈവേ \n" +
            "ഏറ്റവും വലിയ ചരക്കുകപ്പൽ : ബെർഗ് സ്റ്റാൾ \n" +
            "ഏറ്റവും നീളം കൂടിയ പാലം : ന്യൂ റിവർ ജോർജ് പാലം \n" +
            "ഏറ്റവും വലിയ ഹോട്ടൽ : എക്സാലിബർ ഹോട്ടൽ \n" +
            "ഏറ്റവും വലിയ ബാങ്ക് : ലോകബാങ്ക് (വാഷിംഗ്ടൺ)\n" +
            "ഏറ്റവും വലിയ ലൈബറി : ലൈബ്രറി ഓഫ് കോൺഗ്രസ്\n" +
            "ഏറ്റവും വലിയ കൊട്ടാരം : ഇംപീരിയൽ പാലസ് (ബൈ യജിങ്ങ്)\n" +
            "ഏറ്റവും വലിയ നിയമനിർമാണ സഭ :നാഷണൽ പീപ്പിൾസ് കോൺഗ്രസ് (ചൈന) \n" +
            "ഏറ്റവും നീളം കൂടിയ റെയിൽവേ ലൈൻ - ടാൻസ് സൈബീരിയൻ റെയിൽവേ\n" +
            "ഏറ്റവും ഉയരം കൂടിയ മരം-കോസ്റ്റ് റെഡവുഡ് (കാലിഫോർണിയ) \n" +
            "ഏറ്റവും വലിയ പാർക്ക് -വുഡ് ബഫല്ലോ നാഷണൽ പാർക്ക് \n" +
            "ഏറ്റവും നീളം കൂടിയ മനുഷ്യനിർമിത കനാൽ :സൂയസ് കനാൽ";
    String big = "ഏറ്റവും ആദ്യം";
    String big1  = "വനിതാ പ്രധാനമന്ത്രി : സിരിമാവോ ബന്ദാരനായകെ \n" +
            "ഐക്യരാഷ്ട്ര സഭയുടെ ആദ്യ വനിതാ പ്രസിഡണ്ട് : വിജയലക്ഷ്മി പണ്ഡിറ്റ് \n" +
            "ആദ്യ ടെസ്റ്റ്ബ് ശിശു : ലൂയിസ് ബൗൺ \n" +
            "ആദ്യ സയാമീസ് ഇരട്ടകൾ : പാൻ, ഇൻ \n" +
            "ആദ്യ പത്രം: റിലേഷൻ \n" +
            "ബഹിരാകാശ സഞ്ചാരി : യൂറി ഗഗാറിൻ \n" +
            "വനിതാ ബഹിരാകാശ സഞ്ചാരി :വാലന്റീന തെരഷ്കോവ \n" +
            "ചന്ദ്രനിൽ കാലുകുത്തിയ മനുഷ്യൻ : നീൽ ആംസ്ട്രോംഗ് \n" +
            "ഉത്തരധ്രുവത്തിൽ ആദ്യമെത്തിയ വ്യക്തി :റോബർട്ട് പിയറി \n" +
            "ലോകം ചുറ്റിയ ആദ്യ വനിതാ പൈലറ്റ്: ജെറി മോക്ക് \n" +
            "എവറസ്റ്റ് കീഴടക്കിയ ആദ്യ വനിത :ജംഗോ താബേ \n" +
            "ലോകം ചുറ്റിയ ആദ്യ കപ്പൽ :വിക്ടോറിയ \n" +
            "ആദ്യ പോസ്റ്റൽ സ്റ്റാമ്പ്: ബ്ലാക്ക് പെന്നി \n" +
            "ആദ്യമായി എവറസ്റ്റ് കൊടുമുടി കീഴടക്കിയവർ : ടെൻസിംഗ്, ഹിലാരി";
    String first  = "പാർലമെന്റുകൾ";
    String first1  = "സ്പെയിൻ : കോർട്ട്സ് \n" +
            "ജപ്പാൻ : ഡയറ്റ് \n" +
            "ഇറ്റലി : സെനറ്റ് \n" +
            "ഇറാൻ : മജ്ലിസ് \n" +
            "(ഫാൻസ് : ചേംബർ \n" +
            "പോളണ്ട് : സജ് \n" +
            "റഷ്യ : ഡ്യൂമ \n" +
            "ഇസായേൽ : ക്നെസിറ്റ് \n" +
            "യു.എസ്.എ. : കോൺഗ്രസ് \n" +
            "ബംഗ്ലാദേശ് : ജാതീയ സൻസദ് \n" +
            "മലേഷ്യ : ഡിവൈൻ റി ക്യാറ്റ് \n" +
            "നേപ്പാൾ: നാഷണൽ അസംബ്ലി \n" +
            "ഇന്ത്യ ; രാജ്യസഭ, ലോക്സഭ \n" +
            "ബ്രിട്ടൻ : കോമൺസ് സഭ,  പ്രഭുസഭ\n" +
            "അഫ്ഗാനിസ്ഥാൻ : ഷോറ \n" +
            "പാകിസ്താൻ : നാഷണൽ അസംബ്ലി \n" +
            "സ്വിറ്റ്സർലാന്റ് : ഫെഡറൽ അസംബ്ലി \n" +
            "ചൈന : നാഷണൽ പീപ്പിൾസ് കോൺഗ്രസ്";
    String coin  = "നാണയങ്ങളും";
    String coin1  = "ഇറാക്ക് : ദിനാർ \n" +
            "അമേരിക്ക: ഡോളർ \n" +
            "ഇറാൻ : റിയാൽ \n" +
            "ഇറ്റലി : ലിറ\n" +
            "ഈജിപ്ത്: പൗണ്ട് \n" +
            "ഉഗാണ്ട് : ഷില്ലിങ്ങ് \n" +
            "കുവൈറ്റ് : ദിനാർ \n" +
            "കൊറിയ : വോൺ \n" +
            "ചൈന : യുവാൻ \n" +
            "ജപ്പാൻ : യെൻ \n" +
            "നേപ്പാൾ : നേപ്പാളി രൂപ \n" +
            "വെനെസ്വേല : ബൊളിവർ \n" +
            "റഷ്യ: റൂബിൾ \n" +
            "ബംഗ്ലാദേശ് : ടാക്ക \n" +
            "ശീലങ്ക : രൂപ \n" +
            "മലാവി : കോജ \n" +
            "തുർക്കി: ലിറ \n" +
            "മ്യാൻമർ : ക്യാട്ട് \n" +
            "സിംഗപ്പൂർ : ഡോളർ \n" +
            "ന്യൂസിലാന്റ് : ഡോളർ\n" +
            "നൈജീരിയ : നെറ \n" +
            "ജർമനി : മാർക്ക് ";

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_world);

        toolbar= (android.support.v7.widget.Toolbar) findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);

        ArrayAdapter adapter = new ArrayAdapter<String>(this,
                R.layout.activity_listview, mobileArray);

        listView = (ListView) findViewById(R.id.mobile_list);
        listView.setAdapter(adapter);
        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            public void onItemClick(AdapterView<?> parent, View view,
                                    int position, long id) {
                if (position == 0) {
                    Intent myIntent = new Intent(view.getContext(), allLearn.class);
                    myIntent.putExtra("epuzzle", ministers);
                    myIntent.putExtra("epuzzle1", ministers1);
                    startActivityForResult(myIntent, 0);
                }

                if (position == 1) {
                    Intent myIntent = new Intent(view.getContext(), allLearn.class);
                    myIntent.putExtra("epuzzle", big);
                    myIntent.putExtra("epuzzle1", big1);
                    startActivityForResult(myIntent, 0);
                }

                if (position == 2) {
                    Intent myIntent = new Intent(view.getContext(), allLearn.class);
                    myIntent.putExtra("epuzzle", first);
                    myIntent.putExtra("epuzzle1", first1);
                    startActivityForResult(myIntent, 0);
                }
                if (position == 3) {
                    Intent myIntent = new Intent(view.getContext(), allLearn.class);
                    myIntent.putExtra("epuzzle", coin);
                    myIntent.putExtra("epuzzle1", coin1);
                    startActivityForResult(myIntent, 0);
                }


            }
        });


    }
}
